---
title: "GSLLの導入(Roswell)"
date: 2021-05-05T14:34:49+09:00
description: "RoswellでのGNU Scientific Library for Lispの導入。"
tags: [common lisp, numerical calculation]
---

既にある[gsllを入れる(quicklisp) - Nosの日記](http://nos.hateblo.jp/entry/20120101/1325427824)(2012)の二番煎じな内容。

以下はUbuntu20.04(WSL2)でRoswellが入ってるものとしての説明。
処理系はSBCL。


# GSLLとは
数値計算のライブラリGNU Scientific Library (GSL)をCommon Lispから使えるようにしたもの。
GNU Scientific Library for Lisp、略してGSLL。
公式サイトは[GNU Scientific Library for Lisp](https://common-lisp.net/project/gsll/)。
もともとのGSLは[GSL - GNU Scientific Library](https://www.gnu.org/software/gsl/)。

**基本的に公式を読めば解決。公式を読もう。**


# GSLLの導入の前に
公式にある通り、まずは
```bash
sudo apt install libgsl0-dev libffi-dev
```
で必要なパッケージをインストールする（`libgsl0-dev`で実際にインストールされるのは`libgsl-dev`と表示された）。


# GSLLの導入
必要なパッケージは上のコマンドでインストールされたはずなので、Roswell環境下のQuicklispが使える状態で
```lisp
(ql:quickload :gsll)
```
を実行することでGSLLが使えるようになる。


# ユニットテスト
上述のWebサイトを真似てユニットテストを実行してみると
```lisp
; SLIME 2.24

CL-USER> (ql:quickload :lisp-unit)
To load "lisp-unit":
  Load 1 ASDF system:
    lisp-unit
; Loading "lisp-unit"

(:LISP-UNIT)

CL-USER> (ql:quickload :gsll)
To load "gsll":
  Load 1 ASDF system:
    gsll
; Loading "gsll"
..................
(:GSLL)

CL-USER> (in-package :gsll)
#<PACKAGE "GSLL">

GSL> (lisp-unit:run-tests)
Unit Test Summary
 | 3994 assertions total
 | 3902 passed
 | 92 failed
 | 4 execution errors
 | 0 missing tests

#<TEST-RESULTS-DB Total(3994) Passed(3902) Failed(92) Errors(4)>
```
という結果になった。


# GSLLの初歩的な使い方
それほど使いこなせているわけではないので、初歩的な使い方のみ述べる。
GSLLは基本的に`double-float`用のパッケージなので
```lisp
(setq *read-default-float-format* 'double-float)
```
で特に指定していない時の浮動小数点数を`double-float`にしておく。

GSLのドキュメント（英語であれば[GSL - GNU Scientific Library](https://www.gnu.org/software/gsl/)の半ばに、日本語訳は[GSL 1.15 リファレンス・マニュアル 日本語訳](http://cbrc3.cbrc.jp/~tominaga/translations/gsl/gsl-1.15/index.html)）が充実しているので、基本的にはここで必要なものを調べて、対応するCommon lispでの名前を
```lisp
(gsl-lookup "gsl_sf_zeta_e")
ZETA
T
```
のように検索する。

あとは普通に`describe`を使って
```lisp
GSL> (describe 'zeta)
GSLL:ZETA
  [symbol]

ZETA names a generic function:
  Lambda-list: (X)
  Derived type: (FUNCTION (T) *)
  Documentation:
    The Riemann zeta function zeta(n).
  Method-combination: STANDARD
  Methods:
    (ZETA (FLOAT))
      Documentation:
        The Riemann zeta function zeta(s) for arbitrary s, s ne 1.
    (ZETA (INTEGER))
      Documentation:
        The Riemann zeta function zeta(n) for integer n, n ne 1.
  Source file: /home/shimo/.roswell/lisp/quicklisp/dists/quicklisp/software/gsll-quicklisp-eeeda841-git/special-functions/zeta.lisp
; No value
```
のようにある程度の使い方の確認が出来る。

半無限区間の積分、例えばガウス積分は
```lisp
GSL> (setq *read-default-float-format* 'double-float)
DOUBLE-FLOAT

GSL> *default-absolute-error*
1.0e-5

GSL> (* 2 (integration-qagiu (lambda (x) (exp (* -1.0 x x))) 0.0))
1.7724538509067373

GSL> (sqrt pi)
1.7724538509055159

GSL> (setq  *default-absolute-error* 1.0e-8)
1.0e-8

GSL> (* 2 (integration-qagiu (lambda (x) (exp (* -1.0 x x))) 0.0))
1.7724538509055159
```
のように実行できる。

行列演算の扱いの導入については上述の[gsllを入れる(quicklisp) - Nosの日記](http://nos.hateblo.jp/entry/20120101/1325427824)に載っている。
```lisp
GSL> (setq grid:*default-grid-type* 'grid:foreign-array)
GRID:FOREIGN-ARRAY

GSL> (matrix-product #m(1 2 ^ 3 4) #m(5 6 ^ 7 8))
#m((19.000000000000000d0 22.000000000000000d0)
(43.000000000000000d0 50.000000000000000d0))
```
